---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DisplacedElementDisplacementX
source: html/4e2c051a-e5ca-a5a3-efb8-48d3cafa0b46.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DisplacedElementDisplacementX Property

"X Displacement"

## Syntax (C#)
```csharp
public static ForgeTypeId DisplacedElementDisplacementX { get; }
```